Documents/ПоступлениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеМатериалов</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказыПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказПоставщику</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДопРасходы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредварительнаяНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопРасходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ДопРасходыПриИзмененииНаСервере()
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	УчтеннаяСумма = 0; 
	Если ОбщаяСуммаМатериала > 0 Тогда
		Для каждого Строка Из Объект.Материалы цикл
			Строка.ДопРасходы = Строка.Сумма / ОбщаяСуммаМатериала * ОбщаяСуммаДопРасхода;
			УчтеннаяСумма = УчтеннаяСумма + Строка.ДопРасходы 
		КонецЦикла;
		Если УчтеннаяСумма <> ОбщаяСуммаДопРасхода Тогда
			Строка.ДопРасходы = Строка.ДопРасходы - (УчтеннаяСумма - ОбщаяСуммаДопРасхода);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыПриИзменении(Элемент)
	ДопРасходыПриИзмененииНаСервере();
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	ОбщаяСумма = ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
КонецПроцедуры 

&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
	ДопРасходыПриИзмененииНаСервере();
	ОбщаяСуммаДопРасхода = Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала = Объект.Материалы.Итог("Сумма");
	ОбщаяСумма = ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьРасходы(Команда)
	ДопРасходыПриИзмененииНаСервере()
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДопРасходы.ТекущиеДанные;
	ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ДопРасходыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ДопРасходы.ТекущиеДанные;
	ТекущаяСтрока.СуммаСНДС = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбщаяСуммаДопРасхода 	= Объект.ДопРасходы.Итог("СуммаСНДС");
	ОбщаяСуммаМатериала 	= Объект.Материалы.Итог("Сумма");
	ОбщаяСумма 				= ОбщаяСуммаДопРасхода + ОбщаяСуммаМатериала;
	
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
	
	Если НЕ РольДоступна("ЦеныЗакупки") Тогда
	
		ЭтаФорма.Элементы.МатериалыЦена.Видимость 			= Ложь;	
		ЭтаФорма.Элементы.МатериалыСуммаСНДС.Видимость 		= Ложь;	
		ЭтаФорма.Элементы.ГруппаДопРасходы.Видимость 		= Ложь;	
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись_ПоступлениеМатериалов", ПараметрыЗаписи, Новый Структура("Ссылка",Объект.Ссылка));
	Оповестить("ИзменениеЦены", Новый Структура("Номенклатура",омТЧ_НаКлиентеСервере.КолонкуВМассив(Объект.Материалы, "Номенклатура")));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьЕдиницуПриИзмененииМатериала(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдИзмНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТД = Элементы.Материалы.ТекущиеДанные;
	Элемент.СписокВыбора.ЗагрузитьЗначения(омЕдиницыИзмерения.ЕдиницыИзмеренийНоменклатурыДляВыбора(ТД.Номенклатура));
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдИзмПриИзменении(Элемент)
	омЕдиницыКлиент.ЗаполнитьКоэффициентПриИзмененииЕдиницы(Элементы.Материалы.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	//ВидимостьПолейОбъект();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//омВидимостьСделки.КонтрольУникальностиОбъект(Объект, ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыОбъектПриИзменении(Элемент)
	//ВидимостьПолейОбъект();
КонецПроцедуры
